---
kind: method
id: M:Autodesk.Revit.DB.GBXMLExportOptions.Dispose
source: html/9fc6ebfd-2f9c-1555-a24a-8ad845ee039d.htm
---
# Autodesk.Revit.DB.GBXMLExportOptions.Dispose Method

Releases all resources used by the GBXMLExportOptions

## Syntax (C#)
```csharp
public void Dispose()
```